{
  "books": [
    {
      "id": 1,
      "title": "Test-Driven Development: By Example",
      "author": "Kent Beck",
      "description": "Libro del creador de TDD que explica con un ejemplo los pasos que sigue para ir resolviendo un problema sencillo. Muy interesante todo el grupo de patrones que presenta en el tercer capitulo y al que no siempre se le presta atención.",
      "link": "https://www.goodreads.com/book/show/387190.Test_Driven_Development"
    },
    {
      "id": 2,
      "title": "Growing Object-Oriented Software, Guided by Tests",
      "author": "Steve Freeman, Nat Pryce",
      "description": "Muy buen libro sobre TDD. Cuenta con un ejemplo que van desarrollando y combinan la teoría muy bien. Además de ver el enfoque de la London School. Aunque no es un libro dificil de leer, tiene mucho conocimiento condensado y con el tiempo empiezas a apreciar las cosas de las que habla. Especialmente relevante como combina TDD con el enfoque de orientación a objetos de Rebbeca Wirsf-Brock.",
      "link": "https://www.goodreads.com/book/show/4268826-growing-object-oriented-software-guided-by-tests?from_search=true&from_srp=true&qid=4QWUNCBx1A&rank=1"
    },
    {
      "id": 3,
      "title": "Refactoring: Improving the Design of Existing Code 1st edition",
      "author": "Martin Fowler,",
      "description": "Todos los ejemplos vienen en Java. Incluye refactorings largos que ya no aparecen en la segunda edición. Algunas mecánicas de refactoring han quedado obsoletas en java gracias a la potencia de los IDEs actuales. La discusión de code smells es mejor en el Refactoring Workbook.",
      "link": "https://www.goodreads.com/book/show/44936.Refactoring"
    },
    {
      "id": 4,
      "title": "Refactoring: Improving the Design of Existing Code 2nd edition",
      "author": "Martin Fowler,",
      "description": "Todos los ejemplos son en JavaScript. Los nombres de muchos refactorings han cambiado para abrirse a formas de trabajar más funcionales. El capítulo de smells ha variado un poco, para mi ha mejorado. El capítulo en que se explica el concepto de refactoring, su implicación económica, las herramientas y los workflows de refactoring ha mejorado muchísimo gracias a la experiencia de un montón de años. Creo que leería en este libro primero, y luego dependiendo del lenguaje que te interese miraría el catálogo de refactorings de la primera edición que sigue siendo más ameno a lenguajes como Java o PHP.",
      "link": "https://martinfowler.com/articles/refactoring-2nd-ed.html"
    },
    {
      "id": 5,
      "title": "Implementation Patterns",
      "author": "Kent Beck",
      "description": "Es como Clean Code pero desde mi punto de vista con menos dogma, y mejor razonado. Es la versión Java de un libro que originalmente salió para Smalltalk, pero los principios y patrones que explican puede aportar muchísimo a cualquier programador.",
      "link": "https://www.goodreads.com/book/show/781559.Implementation_Patterns"
    },
    {
      "id": 6,
      "title": "Agile Principles, Patterns, and Practices in C#",
      "author": "Robert C. Martin, Micah Martin",
      "description": "La mejor explicación de SOLID y de los principios de gestión de dependencias entre paquetes que he visto. De cuando el autor no había caido aún en el dogmatismo. Los ejemplos están en C#, pero aporta mucho a cualquier lenguaje.",
      "link": "https://www.goodreads.com/book/show/84983.Agile_Principles_Patterns_and_Practices_in_C_"
    },
    {
      "id": 7,
      "title": "Principles of Package Design",
      "author": "Matthias Noback",
      "description": "Complementa a Agile Principles, Patterns, and Practices in C# porque incluye un montón de ejemplos que ayudan a profundizar más en SOLID y en los principios de gestión de depedencias entre paquetes. Los ejemplos están en PHP.",
      "link": "https://matthiasnoback.nl/book/principles-of-package-design/"
    },
    {
      "id": 8,
      "title": "Practical Object-Oriented Design: An Agile Primer Using Ruby, 2nd Edition",
      "author": "Sandi Metz",
      "description": "Una gran exposición de la OO basada desde la filosofía de modelar comportamientos y responsabilidades. Ojalá se usase en la enseñanza de OO.",
      "link": "https://www.pearson.com/en-us/subject-catalog/p/practical-object-oriented-design-an-agile-primer-using-ruby/P200000000472?view=educator"
    },
    {
      "id": 9,
      "title": "Head First Design Patterns",
      "author": "Head First Series",
      "description": "Ls patrones más usados explicados de una manera muy didáctica. El libro es realmente bueno y trata las ideas con mucha profundidad. Al mismo tiempo consiguen hacerlo entretenido. Toda una hazaña!",
      "link": "https://www.oreilly.com/library/view/head-first-design/0596007124/"
    },
    {
      "id": 10,
      "title": "Working Effectively with Legacy Code",
      "author": "Michael Feathers",
      "description": "Recomendado para aprender técnicas que te permitan introducir tests en código legacy poco o no testeable, y a partir de ahí poder empezar a refactorizarlo. También te ayuda a que te des cuenta de cómo hacer tu código más testeable.",
      "link": "https://www.oreilly.com/library/view/working-effectively-with/0131177052/"
    }
  ],
  "follows": [
    {
      "id": 1,
      "name": "Step4ward",
      "type": "Community",
      "description": "Inspiring and mentoring women in tech",
      "link": "https://step4ward.notion.site/",
      "avatar": "/public/images/collaborate.svg"
    },
    {
      "id": 2,
      "name": "No me da la vida",
      "type": "Podcast",
      "description": "By Alba Silvente (@dawntraoz) and Miriam González (@miriamgonp)",
      "link": "https://www.youtube.com/c/nomedalavida",
      "avatar": "/public/images/radio.svg"
    },
    {
      "id": 3,
      "name": "DonesTech",
      "type": "Divulgation",
      "description": "News, Transfeminist security, Workshops...",
      "link": "https://www.youtube.com/c/nomedalavida",
      "avatar": "/public/images/video.svg"
    },
    {
      "id": 4,
      "name": "Women Who Code",
      "type": "Community",
      "description": "International inclusive community producing trainings, conferences, hackatons...",
      "link": "https://www.youtube.com/user/WomenWhoCode",
      "avatar": "/public/images/study.svg"
    }
  ]
}
